# Basic Questions

Q.1) What is Pandas in python?
Pandas is a open source analysis and manipulation library in python. It provides data structures and functions needed to work on structured data. Most of the mahematical operations are done using the pandas on the DataFrames.

Q.2) What are the key data structures in Pandas?
1) Series: It is a one dimensional labeled array capable on holding any data type, that means basically series can contain any data types from the string, float, bool etc or mixture of it also.
2) DataFrame: It is two dimensional labeled data structure in pandas which contains data in the form of row and columns. It can be made up with either one of the datatype or combination of all.

Q.3) How do you create a series in Pandas?

In [2]:
import pandas as pd
data = [1,2,3,4]
series = pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
data1 = ['Keshav', 'Mahesh', 'Joshi', 26, 2001]
series1 = pd.Series(data1)
print(series1)

0    Keshav
1    Mahesh
2     Joshi
3        26
4      2001
dtype: object

Q.4) How do you create DataFrame in Pandas?

In [4]:
import pandas as pd
data2 = {'Name': ['Keshav', 'Sweety', 'Pankaj', 'Onkar', 'Pooja', 'Ajinkya', 'Keshav'], 'Gender': ['Male', 'Female', 'Male', 'Male', 'Female', 'Male', 'Male'], 'Age': [23,23,23,22,21, 'NA', 23], 'Marks': [70, 85,72,73,75,'NA', 70]}
df = pd.DataFrame(data2)
print(df)

      Name  Gender Age Marks
0   Keshav    Male  23    70
1   Sweety  Female  23    85
2   Pankaj    Male  23    72
3    Onkar    Male  22    73
4    Pooja  Female  21    75
5  Ajinkya    Male  NA    NA
6   Keshav    Male  23    70

Q.5) How do you write a DataFrame to CSV file?

In [5]:
df.to_csv('output.csv', index = False)

Q.6) How to read CSV file using pandas?

In [6]:
import pandas as pd 
student_data = pd.read_csv('output.csv')
student_data

      Name  Gender   Age  Marks
0   Keshav    Male  23.0   70.0
1   Sweety  Female  23.0   85.0
2   Pankaj    Male  23.0   72.0
3    Onkar    Male  22.0   73.0
4    Pooja  Female  21.0   75.0
5  Ajinkya    Male   NaN    NaN
6   Keshav    Male  23.0   70.0

Q.7) How do you read the first few rows of the DataFrame?

In [7]:
student_data.head(2)

     Name  Gender   Age  Marks
0  Keshav    Male  23.0   70.0
1  Sweety  Female  23.0   85.0

In [8]:
# For bottom few rows
student_data.tail(2)

      Name Gender   Age  Marks
5  Ajinkya   Male   NaN    NaN
6   Keshav   Male  23.0   70.0

Q.8) How do you get summary statistics of the data?

In [9]:
student_data.describe()

            Age      Marks
count   6.00000   6.000000
mean   22.50000  74.166667
std     0.83666   5.636193
min    21.00000  70.000000
25%    22.25000  70.500000
50%    23.00000  72.500000
75%    23.00000  74.500000
max    23.00000  85.000000

Q.9) How do you get list of Column names in DataFrame?

In [10]:
student_data.columns

Index(['Name', 'Gender', 'Age', 'Marks'], dtype='object')

Q.10) How do you access specific column in DataFrame?

In [11]:
student_data['Name']

0     Keshav
1     Sweety
2     Pankaj
3      Onkar
4      Pooja
5    Ajinkya
6     Keshav
Name: Name, dtype: object

Q.11) How do you access multiple columns in DataFrmae?

In [12]:
student_data[['Name', 'Age']]

      Name   Age
0   Keshav  23.0
1   Sweety  23.0
2   Pankaj  23.0
3    Onkar  22.0
4    Pooja  21.0
5  Ajinkya   NaN
6   Keshav  23.0

Q.12) How do you access specific row in DataFrame?

In [13]:
student_data.iloc[1]

Name      Sweety
Gender    Female
Age         23.0
Marks       85.0
Name: 1, dtype: object

In [14]:
student_data.iloc[0]

Name      Keshav
Gender      Male
Age         23.0
Marks       70.0
Name: 0, dtype: object

Q.13) How do you filter rows in DataFrame based on specific condition?

In [15]:
student_data[student_data['Marks']>72]

     Name  Gender   Age  Marks
1  Sweety  Female  23.0   85.0
3   Onkar    Male  22.0   73.0
4   Pooja  Female  21.0   75.0

In [16]:
student_data[student_data['Age']<25]

     Name  Gender   Age  Marks
0  Keshav    Male  23.0   70.0
1  Sweety  Female  23.0   85.0
2  Pankaj    Male  23.0   72.0
3   Onkar    Male  22.0   73.0
4   Pooja  Female  21.0   75.0
6  Keshav    Male  23.0   70.0

In [17]:
student_data[student_data['Marks']==85]

     Name  Gender   Age  Marks
1  Sweety  Female  23.0   85.0

Q.14) How do you handle with the missing values in DataFrame?

In [18]:
# First find is there are any null values present in the dataframe
student_data.isna().sum()

Name      0
Gender    0
Age       1
Marks     1
dtype: int64

In [19]:
# Remove it or replace with appropriate statistics
# Here we are going to replace that values with mean
mean = student_data[['Age', 'Marks']].mean()
student_data.fillna(mean)

      Name  Gender   Age      Marks
0   Keshav    Male  23.0  70.000000
1   Sweety  Female  23.0  85.000000
2   Pankaj    Male  23.0  72.000000
3    Onkar    Male  22.0  73.000000
4    Pooja  Female  21.0  75.000000
5  Ajinkya    Male  22.5  74.166667
6   Keshav    Male  23.0  70.000000

Q.15) How do you sort a DataFrame by a specific column?

In [20]:
student_data.groupby('Age').sum()

                          Name              Gender  Marks
Age
21.0                     Pooja              Female   75.0
22.0                     Onkar                Male   73.0
23.0  KeshavSweetyPankajKeshav  MaleFemaleMaleMale  297.0

In [21]:
df1 = pd.read_csv('book1.csv')
df1

     Name  Gender  Age  Marks
0  Keshav    Male   23     72
1  Sweety  Female   23     85
2  Pankaj    Male   22     82
3   Onkar    Male   21     75
4   Pooja  Female   25     79

Q.16) How do you merge two DataFrames?

In [22]:
# Here Name is the common column in both the DataFrames so we are going to use that column for Merge
import pandas as pd
student_data.merge(df1, on = 'Name')

     Name Gender_x  Age_x  Marks_x Gender_y  Age_y  Marks_y
0  Keshav     Male   23.0     70.0     Male     23       72
1  Sweety   Female   23.0     85.0   Female     23       85
2  Pankaj     Male   23.0     72.0     Male     22       82
3   Onkar     Male   22.0     73.0     Male     21       75
4   Pooja   Female   21.0     75.0   Female     25       79
5  Keshav     Male   23.0     70.0     Male     23       72

Q.17) How do you concatenate two DataFrames?

In [23]:
import pandas as pd
pd.concat([student_data, df1], axis = 1) # axis=1 stack the one datafrmae above the next and if not given then it defaultly stack it as one below another.

      Name  Gender   Age  Marks    Name  Gender   Age  Marks
0   Keshav    Male  23.0   70.0  Keshav    Male  23.0   72.0
1   Sweety  Female  23.0   85.0  Sweety  Female  23.0   85.0
2   Pankaj    Male  23.0   72.0  Pankaj    Male  22.0   82.0
3    Onkar    Male  22.0   73.0   Onkar    Male  21.0   75.0
4    Pooja  Female  21.0   75.0   Pooja  Female  25.0   79.0
5  Ajinkya    Male   NaN    NaN     NaN     NaN   NaN    NaN
6   Keshav    Male  23.0   70.0     NaN     NaN   NaN    NaN

In [24]:
pd.concat([student_data, df1])

      Name  Gender   Age  Marks
0   Keshav    Male  23.0   70.0
1   Sweety  Female  23.0   85.0
2   Pankaj    Male  23.0   72.0
3    Onkar    Male  22.0   73.0
4    Pooja  Female  21.0   75.0
5  Ajinkya    Male   NaN    NaN
6   Keshav    Male  23.0   70.0
0   Keshav    Male  23.0   72.0
1   Sweety  Female  23.0   85.0
2   Pankaj    Male  22.0   82.0
3    Onkar    Male  21.0   75.0
4    Pooja  Female  25.0   79.0

Q.18) What is difference between Merge and Concat?
The main difference between Merge and Concat is that Merge requires a common column to combine two DataFrames but concat does not, and Concat can be used amolg both the axis 0, 1 that is you can combine the two DataFrames as one after one or one below one.

Q.19) How to deal with the duplicates in the DataFrame?

In [25]:
# First check for the duplicates in the DataFrame.
student_data.duplicated().sum().sum()

1

In [26]:
# Remove the Duplicates
student_data.drop_duplicates()

      Name  Gender   Age  Marks
0   Keshav    Male  23.0   70.0
1   Sweety  Female  23.0   85.0
2   Pankaj    Male  23.0   72.0
3    Onkar    Male  22.0   73.0
4    Pooja  Female  21.0   75.0
5  Ajinkya    Male   NaN    NaN

Q.20) How do you rename the columns?

In [27]:
student_data.rename(columns={'Name': 'Student_Name'})

  Student_Name  Gender   Age  Marks
0       Keshav    Male  23.0   70.0
1       Sweety  Female  23.0   85.0
2       Pankaj    Male  23.0   72.0
3        Onkar    Male  22.0   73.0
4        Pooja  Female  21.0   75.0
5      Ajinkya    Male   NaN    NaN
6       Keshav    Male  23.0   70.0

Q.21) How do you apply fuction to elements in a DataFrame?

In [28]:
print(student_data)
# Define a function to apply
def Age_Adjustment(X):
    return X+2
# Apply to a Age column in DataFrame
student_data_new = student_data['Age'].apply(Age_Adjustment)
print(student_data_new)

      Name  Gender   Age  Marks
0   Keshav    Male  23.0   70.0
1   Sweety  Female  23.0   85.0
2   Pankaj    Male  23.0   72.0
3    Onkar    Male  22.0   73.0
4    Pooja  Female  21.0   75.0
5  Ajinkya    Male   NaN    NaN
6   Keshav    Male  23.0   70.0
0    25.0
1    25.0
2    25.0
3    24.0
4    23.0
5     NaN
6    25.0
Name: Age, dtype: float64

# Note that to apply function to each and every element in a DataFrame use .applymap() method.

Q.22) How do you reset a index of DataFrame?

In [29]:
student_data.reset_index()

   index     Name  Gender   Age  Marks
0      0   Keshav    Male  23.0   70.0
1      1   Sweety  Female  23.0   85.0
2      2   Pankaj    Male  23.0   72.0
3      3    Onkar    Male  22.0   73.0
4      4    Pooja  Female  21.0   75.0
5      5  Ajinkya    Male   NaN    NaN
6      6   Keshav    Male  23.0   70.0

Q.23) How do you set a column as a index of DataFrame?

In [30]:
student_data.set_index('Age')

         Name  Gender  Marks
Age
23.0   Keshav    Male   70.0
23.0   Sweety  Female   85.0
23.0   Pankaj    Male   72.0
22.0    Onkar    Male   73.0
21.0    Pooja  Female   75.0
NaN   Ajinkya    Male    NaN
23.0   Keshav    Male   70.0

Q.24) How do you get unique values in a column?

In [31]:
student_data['Gender'].unique()

array(['Male', 'Female'], dtype=object)

Q.25) How do you get number of unique values in a column?

In [32]:
student_data['Marks'].nunique()

5

Q.26) How do you count occurence of each unique value in a column?

In [33]:
student_data['Gender'].value_counts()

Gender
Male      5
Female    2
Name: count, dtype: int64

Q.27) How do you create a Pivote Table in Pandas?

In [34]:
student_data.pivot_table(index = 'Gender', columns = 'Name', values = 'Marks', aggfunc = 'sum')

Name    Ajinkya  Keshav  Onkar  Pankaj  Pooja  Sweety
Gender
Female      NaN     NaN    NaN     NaN   75.0    85.0
Male        0.0   140.0   73.0    72.0    NaN     NaN

Q.28) How do you read Excel File using Pandas?
To Read excel file use
pd.read_excel('file.xlsx')

Q.29) How do you write a DataFrame to Excel file?
To Write a DataFrame into Excel file use
pd.to_excel('student_data.xlsx', index= False)

Q.30) How do you read Json file?
pd.read_json('file.json')
and to write a DataFrame in Json file use the code
pd.to_json('student_data.json', index=False)

Q.31) How do you read SQL Database table into a DataFrame?

import mysql.connector
import pandas as pd

# Connect to the MySQL database
conn = mysql.connector.connect(
    host='localhost',
    user='root',
    password='root123',
    database='classicmodels'
)

# Query the database and load data into a DataFrame
dataframe = pd.read_sql_query('SELECT * FROM customers', conn)

print(dataframe)

Q.32) How do you write a DataFrame to an SQL DataBase?
import pandas as pd
from sqlalchemy import create_engine

# Create a sample DataFrame
data = {'Name': ['Keshav', 'Sweety', 'Pankaj'], 'Age': [23, 22, 21], 'Marks': [85, 90, 75]}
df = pd.DataFrame(data)

# Create a connection to the MySQL database
engine = create_engine('mysql+pymysql://username:password@host:port/database_name')

# Write the DataFrame to the MySQL database
df.to_sql('students', engine, if_exists='replace', index=False)

print("DataFrame has been written to the MySQL database.")

Q.33) How do you get a datatype of each column?

In [35]:
student_data.dtypes

Name       object
Gender     object
Age       float64
Marks     float64
dtype: object

In [36]:
#OR
student_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Gender  7 non-null      object
 2   Age     6 non-null      float64
 3   Marks   6 non-null      float64
dtypes: float64(2), object(2)
memory usage: 356.0+ bytes

Q.34) How do you change the data type of a column?

In [37]:
df1['Age'] = df1['Age'].astype('int64')
df1['Age'].dtypes

dtype('int64')

Q.35) How do you filter the rows based on multiple conditions?

In [38]:
df1[(df1['Age']>20) & (df1['Marks']>=75)]

     Name  Gender  Age  Marks
1  Sweety  Female   23     85
2  Pankaj    Male   22     82
3   Onkar    Male   21     75
4   Pooja  Female   25     79

Q.36) How do you handle large DataBase with Pandas?

Chunk_iter = pd.read_csv('large_file.csv', chunksize = 1000)
This code reads the large csv files into smaller chunks or parts, instead of loading the whole csv file it reads the data into parts. For this example it loads the multiple parts of 1000 rows each.

Q.37) How do you get shape of DataFrame?

In [39]:
student_data.shape

(7, 4)

This code give the shape of dataframe that means the number of rows and columns respectively.

Q.38) How do you get the number of columns in DataFrame?

In [40]:
student_data.shape[1]

4

Q.39) How do you get the number of rows in DataFrame?

In [41]:
student_data.shape[0]

7

Q.40) How do you rename the specific column of DataFrame?

In [42]:
student_data_info = student_data.rename(columns={'Name': 'Stu_Name'})
student_data_info

  Stu_Name  Gender   Age  Marks
0   Keshav    Male  23.0   70.0
1   Sweety  Female  23.0   85.0
2   Pankaj    Male  23.0   72.0
3    Onkar    Male  22.0   73.0
4    Pooja  Female  21.0   75.0
5  Ajinkya    Male   NaN    NaN
6   Keshav    Male  23.0   70.0

Q.41) How do you get Minimum and Maximum values from the column?

In [43]:
min_marks = student_data['Marks'].min()
max_marks = student_data['Marks'].max()
print(f'The lowest marks in students are:', min_marks)
print(f'The highest marks in students are:', max_marks)

The lowest marks in students are: 70.0
The highest marks in students are: 85.0

Q.42) Find the Name and Age of the student having lowest and highest marks marks?

In [44]:
lowest_marks = df.loc[student_data['Marks'].idxmin(), ['Name', 'Age']]
highest_marks = df.loc[student_data['Marks'].idxmax(), ['Name', 'Age']]
print(f'The Name and Age of Student having lowest Marks is:', lowest_marks)
print(f'The Name and Age of Student having highest Marks is:', highest_marks)

The Name and Age of Student having lowest Marks is: Name    Keshav
Age         23
Name: 0, dtype: object
The Name and Age of Student having highest Marks is: Name    Sweety
Age         23
Name: 1, dtype: object

Q.43) How do you get the Mean, Median, Mode, Standerd deviation of a perticular column?

In [45]:
Mean = student_data['Marks'].mean()
Median = student_data['Marks'].median()
Mode = student_data['Marks'].mode()
std = student_data['Marks'].std()
print(Mean)
print(Median)
print(Mode)
print(std)

74.16666666666667
72.5
0    70.0
Name: Marks, dtype: float64
5.636192568273964

Q.44) How do you find the correlation of the DataFrame?

In [46]:
# First select the numerical columns only
num_col = student_data.select_dtypes(include=['number'])
# Find the correlation
num_col.corr()

            Age     Marks
Age    1.000000 -0.021206
Marks -0.021206  1.000000

Q.45) How you can perform different types of joins using pandas?

1) inner join :
Keeps only the rows with keys that are common in both DataFrames.

In [47]:
import pandas as pd

# Sample DataFrames
df3 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['A', 'B', 'C']})
df4 = pd.DataFrame({'ID': [2, 3, 4], 'Marks': [85, 90, 95]})

# Perform Inner Join
result = pd.merge(df3, df4, on='ID', how='inner')
print(result)

   ID Name  Marks
0   2    B     85
1   3    C     90

2) Left Join: 
Keeps all rows from the left DataFrame and matches rows from the right DataFrame.

In [48]:
result1 = pd.merge(df3, df4, on='ID', how='left')
print(result1)

   ID Name  Marks
0   1    A    NaN
1   2    B   85.0
2   3    C   90.0

3) Right Join:
Keeps all the rows from the right DataFrame and matched rows from the left DataFrame.

In [49]:
result2 = pd.merge(df3, df4, on = 'ID', how = 'right' )
result2

   ID Name  Marks
0   2    B     85
1   3    C     90
2   4  NaN     95

4) Outer Join:
Keeps all rows from both the DataFrames with NaN where there is no match.

In [50]:
result3 = pd.merge(df3, df4, on = 'ID', how = 'outer')
result3

   ID Name  Marks
0   1    A    NaN
1   2    B   85.0
2   3    C   90.0
3   4  NaN   95.0

Q.46) How do you check memory usage of DataFrame?

In [51]:
student_data.memory_usage()

Index     132
Name       56
Gender     56
Age        56
Marks      56
dtype: int64

Q.47) What is difference between map and apply ? explain with example.

1) map: Works on series, It applies a function element wise in a series. It is ideal for element wise transformations on series only.

In [52]:
import pandas as pd
# Sample series
a = pd.Series([1,2,3,4,5])
# Apply function on each element of series
square = a.map(lambda x: x**2)
print(a)
print(square)

0    1
1    2
2    3
3    4
4    5
dtype: int64
0     1
1     4
2     9
3    16
4    25
dtype: int64

2) apply: It works on both Series and DataFrames. Similar to map(), applies a function element wise.

In [53]:
print(df3)
# appply function to numerical column only to square each value
square1 = df3['ID'].apply(lambda x: x**2)
print(square1)

   ID Name
0   1    A
1   2    B
2   3    C
0    1
1    4
2    9
Name: ID, dtype: int64

Q.48) How do you convert the DataFrame to NumPy array?

In [54]:
array = df3.to_numpy()
array

array([[1, 'A'],
       [2, 'B'],
       [3, 'C']], dtype=object)

Q.49) What are .loc[] and iloc[] used for? explain with example.

1) .loc[]: It is used to access rows and columns by their labels(names).

In [55]:
# Print the info of student in row 2
print(student_data)
print(student_data.loc[1])

      Name  Gender   Age  Marks
0   Keshav    Male  23.0   70.0
1   Sweety  Female  23.0   85.0
2   Pankaj    Male  23.0   72.0
3    Onkar    Male  22.0   73.0
4    Pooja  Female  21.0   75.0
5  Ajinkya    Male   NaN    NaN
6   Keshav    Male  23.0   70.0
Name      Sweety
Gender    Female
Age         23.0
Marks       85.0
Name: 1, dtype: object

In [56]:
# print the name and age of the student in the first row
student_data.loc[0,['Name', 'Age']]

Name    Keshav
Age       23.0
Name: 0, dtype: object

In [57]:
# print the name and age columns only
student_data[['Name', 'Age']]

      Name   Age
0   Keshav  23.0
1   Sweety  23.0
2   Pankaj  23.0
3    Onkar  22.0
4    Pooja  21.0
5  Ajinkya   NaN
6   Keshav  23.0

2) .iloc[]: It is used to access the rows and columns based on their positions.

In [58]:
# Get the name and marks of the student at row number 1 
student_data.iloc[0,[0,3]]

Name     Keshav
Marks      70.0
Name: 0, dtype: object

In [59]:
# Get the info of first and second row student
student_data.iloc[0:2]

     Name  Gender   Age  Marks
0  Keshav    Male  23.0   70.0
1  Sweety  Female  23.0   85.0

The key difference between .loc[] and .iloc[] is that .loc[] can be used to access rows and columns based on both indexing and labels, while .iloc[] is used to access rows and columns based only on indexing. Another difference is that in .loc[], both indices are inclusive, whereas in .iloc[], the second index is exclusive.

Q.50) How do you replace values in DataFrame?

In [60]:
print(df4)
df4_new = df4.replace(to_replace = 90, value = 95, inplace = True)
print(df4_new)

   ID  Marks
0   2     85
1   3     90
2   4     95
None

Q.51) What is the use of crosstab() method?
he crosstab() method in pandas is used to compute a simple cross-tabulation of two or more factors. It creates a table (or matrix) that shows the frequency (or count) of occurrences for combinations of values in the input categories. This is particularly useful for summarizing and analyzing categorical data.

In [61]:
# Suppose you want to count the gender for each name 
cross_tab = pd.crosstab(student_data['Name'], student_data['Gender'])
print(cross_tab)

Gender   Female  Male
Name
Ajinkya       0     1
Keshav        0     2
Onkar         0     1
Pankaj        0     1
Pooja         1     0
Sweety        1     0

 It also can be used in the evaluation of the classification models it give output same as the confusion matrix in that case.

Q.52) How do you deal with outliers in Pandas?

Outliers in a dataset are data points that differ significantly from other observations. Handling outliers is essential as they can skew statistical results and impact data analysis. In pandas, we can deal with outliers in multiple ways:
1) Using Statistical Metods:
# Calculate the interquartile range (IQR)
Q1 = df['column_name'].quantile(0.25)
Q3 = df['column_name'].quantile(0.75)
IQR = Q3 - Q1
# Identify the outliers
lower_bound = Q1 - 1.5*IQR
upper_bound = Q3 + 1.5*IQR
outliers = df[(df['column_name'] < lower_bound) | (df['column_name'] > upper_bound)]
print(outliers) 
# Drop the outliers
df_new = df.drop(outliers.index)

2) Tou can also use boxplot to detect outliers
import pandas as pd 
import matplotlib.pyplot as plt
plt.boxplot(df['column_name'], vert=False, patch_artist=True, boxprops=dict(facecolor="lightblue"))
plt.show()

Q.53) What is difference between index and columns attribute in Pandas?
1) index Attribute:
Represents the row labels of a DataFrame or Series.

It can be used to identify or access rows.

By default, pandas assigns integer indices starting from 0, but it can also be customized (e.g., using a specific column as the index).

2) columns Attribute:
Represents the column labels of a DataFrame.

It can be used to identify or rename columns.

Q.54) How you can round numeric values in a DataFrame?

In [62]:
import pandas as pd

# Create a sample DataFrame
data = {
    'Name': ['Keshav', 'Sweety', 'Pankaj', 'Onkar'],
    'Marks': [85.2567, 90.7894, 72.3456, 75.9876],
    'Attendance': [0.8579, 0.9342, 0.7295, 0.8921]
}
df5 = pd.DataFrame(data)

# Original DataFrame
print("Original DataFrame:")
print(df5)

# Round numerical values to 2 decimal places
df_rounded = df5.round(2)

# DataFrame after rounding
print("\nRounded DataFrame:")
print(df_rounded)

Original DataFrame:
     Name    Marks  Attendance
0  Keshav  85.2567      0.8579
1  Sweety  90.7894      0.9342
2  Pankaj  72.3456      0.7295
3   Onkar  75.9876      0.8921

Rounded DataFrame:
     Name  Marks  Attendance
0  Keshav  85.26        0.86
1  Sweety  90.79        0.93
2  Pankaj  72.35        0.73
3   Onkar  75.99        0.89

Q.55) How can you display all rows and columns of DataFrame?

In [63]:
import pandas as pd
print(student_data)
pd.set_option('display.max_rows', None) # To display all rows
pd.set_option('display.max_columns', None) # To display all columns

      Name  Gender   Age  Marks
0   Keshav    Male  23.0   70.0
1   Sweety  Female  23.0   85.0
2   Pankaj    Male  23.0   72.0
3    Onkar    Male  22.0   73.0
4    Pooja  Female  21.0   75.0
5  Ajinkya    Male   NaN    NaN
6   Keshav    Male  23.0   70.0

Q.56) What are stack() and unstack() in Pandas? 
stack(): It pivots the columns of a DataFrame into the row index.
unstack(): It pivots the innermost level of the row index to columns.

In [64]:
import pandas as pd

# Sample DataFrame
data = {
    'Subject': ['Math', 'Science'],
    'Student1': [85, 90],
    'Student2': [78, 88]
}
df6 = pd.DataFrame(data).set_index('Subject')

print("Original DataFrame:")
print(df6)

# Apply stack()
stacked_df = df6.stack()
print("\nStacked DataFrame:")
print(stacked_df)

Original DataFrame:
         Student1  Student2
Subject
Math           85        78
Science        90        88

Stacked DataFrame:
Subject
Math     Student1    85
         Student2    78
Science  Student1    90
         Student2    88
dtype: int64

In [65]:
# Apply unstack()
unstacked_df = stacked_df.unstack()
print("\nUnstacked DataFrame:")
print(unstacked_df)

Unstacked DataFrame:
         Student1  Student2
Subject
Math           85        78
Science        90        88

Q.57) How do you optimize the memory usage in Pandas?
Convert the object columns into categorical if there are repeated values.
Downcast the numeric columns using .astype()
for example( float64 to float32 etc)

Q.57) What is the difference between deep copy and shallow copy? Explain with the example.
In a shallow copy, changes to the original data affect the copied data and vice versa. In a deep copy, changes to the original data do not affect the copied data and vice versa.

Q.58) How can you replace values in a DataFrame?

In [66]:
import pandas as pd

# Sample DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Score': [80, 90, 80]}
df7 = pd.DataFrame(data)

# Replace all occurrences of 80 with 85
df7 = df7.replace(to_replace=80, value=85)

print(df7)

      Name  Score
0    Alice     85
1      Bob     90
2  Charlie     85

Q.59) How do you group data in pandas? explain with example.
In pandas, grouping data is done using the .groupby() method, which is used to group rows based on specific column values and then perform aggregate operations on these groups. This is particularly useful for summarizing or analyzing data across categories.

In [67]:
import pandas as pd

# Sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Alice', 'Bob', 'Charlie'],
    'Subject': ['Math', 'Math', 'Math', 'Science', 'Science', 'Science'],
    'Score': [85, 90, 78, 88, 76, 95]
}
df8 = pd.DataFrame(data)

# Group by 'Subject' and calculate the mean score
grouped = df8.groupby('Subject')['Score'].mean()

print(grouped)

Subject
Math       84.333333
Science    86.333333
Name: Score, dtype: float64